{
    "001": {
        "category": "IT",
        "sub_category": "使",
        "answer": "IT機器には様々な場面で使用されるものがあり、列挙するにはキリがありません。皆さんのイメージしているパソコンだけではなく、コンビニやスーパーのレジ、今や自動車や炊飯器にまで組み込まれており、あらゆるもので使われています。よって、それぞれの機器で使い道は変わりますが、総じて言えることは「我々の生活を豊かに便利にしてくれるもの」です。"
    },
    "002": {
        "category": "IT",
        "sub_category": "場面",
        "answer": "様々な場面で利用されています。例えば、医療システムや金融システム、公共交通システムなど皆さんの生活になくてはならない場面です。また、スマートフォンのアプリや皆さん大好きなゲーム、動画鑑賞等を行う際に必須となるインターネット環境などにも利用されます。ITの技術がなければ困ってしまう場面がたくさんありそうですね。"
    },
    "003": {
        "category": "IT",
        "sub_category": "可能性",
        "answer": "可能性という点でお答えさせてもらうなら、「無限大∞」が正解だと考えます。現在の技術では、できないことはたくさんあるかもしれませんが、技術の進歩はものすごく高速です。最近では、ドラえもんの秘密道具ですら実際に開発してみようという動きもあります。皆さんが生まれたころにはなかったスマーフォンも今や当たり前の時代であることを考えると、この先のITには「ワクワク」しかありませんね。"
    },
    "004": {
        "category": "IT",
        "sub_category": "何",
        "answer": "ITは、Information Technologyの略です。辞書等では、「インターネットなどの通信とコンピュータとを駆使する情報技術」とあります。また、似た言葉ではICT（Information and Communication Technology：情報伝達技術、情報・知識共有に焦点を当て「コミュニケーション」が強調されている）やIoT（Internet of Things：モノのインターネット、あらゆるモノがインターネットにつながる仕組みや技術のこと）があります。"
    },
    "005": {
        "category": "IT",
        "sub_category": "違",
        "answer": "色々とあると思いますが、例えば、使用するコンピュータのメモリ容量と処理性能があります。昔のコンピュータやICチップにはメモリ容量の制限の都合、作ることができるソフトウェアの容量にも限界がありましたが、近年はメモリ容量増大や拡張技術が発展し、容量は気にしなくてよくなってきました。処理性能も飛躍的に向上しています。AIやVRなど、今後もますます進化していく分野です。大いに期待していきましょう。"
    },
    "006": {
        "category": "IT",
        "sub_category": "どうなる",
        "answer": "進化が著しい分野です。例えば、AI（人工知能）は既に商品の売り上げ予測や経営の意思決定にも利用されています。今はビッグデータという、世界中のスマートフォンなどから集められた情報を解析して活用していますので、人間の情報収集量よりはるかに大きくその中で最適な判断をしています。このため、今後ますます人間の判断により近い決定ができるようになりますので、仕事に大きく影響していきます。これからもIT機器は、「我々の生活を豊かに便利にしてくれる」ことに変わりはありません。上手に活用していくことを心がけていきましょう。"
    },
    "007": {
        "category": "IT",
        "sub_category": "どのような",
        "answer": "列挙するにはキリがありません。IT機器はパソコンだけではなく、コンビニやスーパーのレジ、今や自動車や炊飯器にまで組み込まれており、あらゆるもので使われています。"
    },
    "008": {
        "category": "IT",
        "sub_category": "どのように",
        "answer": "身の回りを生活を便利に豊かにするために使われます。具体的に列挙するにはキリがありません。IT製品はパソコンだけではなく、コンビニやスーパーのレジ、今や自動車や炊飯器にまで使われてます。"
    },
    "009": {
        "category": "IT",
        "sub_category": "気",
        "answer": "ソフトウェアの面：最近はWiFiやインターネット接続される機器が多いので、不意にデータが漏洩しないかは気を付けています。勝手につながってしまうこともあるので、取説があれば必ず読んでから起動します。家のルーターの設定も大事です。　ハードウェアの面：「静電気」です。USBメモリなどよく使いますが、持ったまま静電気で「パチッ」となった瞬間に壊れることもあるので注意が必要です。"
    },
    "010": {
        "category": "IT",
        "sub_category": "期待",
        "answer": "あらゆるシステムを作ることができます。"
    },
    "011": {
        "category": "働",
        "sub_category": "楽",
        "answer": "IT技術者、ゲームクリエイタになるために勉強している学生が成長し、就職し活躍する姿を見届けることに喜びと楽しみを感じます。"
    },
    "012": {
        "category": "VR",
        "sub_category": "仕組み",
        "answer": "現在一般的なVRはスマートフォンのディスプレイを応用した画面をゴーグルの中に内蔵し、左右の目の視点の差でCGやゲームを立体的に見せる技術です。外的なセンサーやゴーグルに内蔵したセンサーで本体の位置や方向を確認し、リアルタイムに位置や方向を再現することで、CGやゲームの中に入り込んだ錯覚を起こします。"
    },
    "013": {
        "category": "VR",
        "sub_category": "使",
        "answer": "最初はゲームや遊園地のアトラクションに使われていましたが、最近では、洋服の試着、モデルハウスの内覧、フライトシミュレーターなどパイロットの訓練でも使われています。まだまだ応用性が期待できます。"
    },
    "014": {
        "category": "VR",
        "sub_category": "魅力",
        "answer": "ゲームで言えば「没入感」です。ゲームのマップ内に入って主人公となり、マップ上を動き回れます。リアルとバーチャルの差を埋めるツールですね。将来的にはもっと形や表示方法も変わると思いますよ。現在では「QDレーザー」という目の網膜に直接映し出す映像機器なども研究されています。"
    },
    "015": {
        "category": "ゲーム",
        "sub_category": "完成までの過程",
        "answer": "大きくは「企画」→「設計」→「プログラミング」→「テスト」と行程を経て完成します。その中で、シナリオ、音楽、キャラクター、背景などそれぞれの創作も必要となります。　制作期間ですが、スマートフォンアプリの小さいものは３か月程度で作られるものもありますが、コンシューマ（家庭用ゲーム機）用のシリーズ大作だと、６年かかるものまであります。制作期間が長くなるだけ、費用がかかっていますので、「確実に売れるもの」を作らなければ赤字になってしまします。"
    },
    "016": {
        "category": "ゲーム",
        "sub_category": "必要",
        "answer": "道具としてはやや処理性能が高いパソコンと、今なら「Unity」や「UnrealEngine」などのゲーム開発エンジン（ソフトウェア）があれば、作ることができますが、それを利用するための知識や、面白いものを作るアイディアやセンスが重要です。詳しくは４，５の回答をご覧ください。"
    },
    "017": {
        "category": "ゲーム",
        "sub_category": "どのように",
        "answer": "開発するゲームの規模によります。２、3人のクリエイタさんのパッとした思い付きでできてしまう小規模なゲームアプリもあれば、数十名のゲームプランナーという人が「確実に売れるもの」としてじっくり企画を練り上げたものを、大きな開発チームで作る大規模なものまであります。　例えば一言で「サッカーゲームを作る」としてもいろいろなコンセプトがあります。　・1人のサッカー選手をリアルタイムに操作して試合をするゲーム　・複数のサッカー選手を切り替えて試合をするゲーム　・監督になり、フォーメンションなど、指示をして試合するゲーム　・監督になり、選手を育てて強豪チームを作るゲーム　また、何十時間も積み上げて遊ぶゲームから、ちょっと暇なとき、１～3分くらいの短時間で完結するゲームなど、どのようなユーザをターゲットにするかまで突き詰めてゲームの内容は考えられます。"
    },
    "018": {
        "category": "ゲーム",
        "sub_category": "情報量",
        "answer": "ゲームにもよります。スマートフォンのアプリでは数MB程度の物もありますが、PS4のソフトはBlu-rayディスクに入っており、片面2層で最大50GBの収容しますので、それくらいが最大と言えます。しかし最近はダウンロード系のゲームもありますので、上限はありません。"
    },
    "019": {
        "category": "ゲーム",
        "sub_category": "技術",
        "answer": "例えば、リアルなカーレースゲームを作るには、車の行動や挙動特性、路面の違いでの滑りの違いなどを知ったり、計算できないとリアルな動きを再現することはできません。そのために、「理科」で運動の法則を学び、「数学」で学んだ複雑な計算ができなくてはなりません。　また、カッコよく画面表示するために、よく「英語」を多用しますし、アドベンチャーゲームなら台詞があるので「国語」の力が必要です。さらに歴史シミュレーションゲームを作るためには「歴史」の勉強が必要です。　道具としてはやや処理性能が高いパソコンと、今なら「Unity」や「UnrealEngine」などのゲーム開発エンジン（ソフトウェア）があれば、作ることができますが、それを利用するための知識や、面白いものを作るアイディアやセンスが重要です。"
    },
    "020": {
        "category": "エラー",
        "sub_category": "対処",
        "answer": "作っている最中の事であれば、「デバッグ」と言って、エラーの状態を確認してプログラムを修正します。最近の開発環境は、入力段階でエラーがわかるので、昔ほど大変ではありません。　運用しているプログラムについても、まずは原因を確認します。ハードウェアの問題か、プログラムの不具合かなどです。ほとんどの場合はアラート（エラー箇所）が表示されるようにプログラミングしていますので、解決までの時間は短いです。また、24時間運用しているシステムの場合は深夜でも対処します。最近のシステムは遠隔操作が可能なので、システムが動いている現地まで行く必要はありません。"
    },
    "021": {
        "category": "プログラミング",
        "sub_category": "道を志した",
        "answer": "「高校２年生」の時です。それまでは人並みにTVゲームで遊んでいる程度でした。"
    },
    "022": {
        "category": "プログラミング",
        "sub_category": "進",
        "answer": "将来的に「コンピュータは無くならない」＝「仕事が無くならない」と思ったからです。　今は働き手の人口が減っていることもあり、自動化やロボット化が進み、いろいろな仕事が無くなっています。その中でコンピュータの仕事は「作る側」になりますので、仕事が無くならないと考えました。"
    },
    "023": {
        "category": "プログラミング",
        "sub_category": "センス",
        "answer": "単に「動く」プログラムを作るためでは「不要」ですが、明快かつ効率的なプログラムを組もうと思うと「必要」です。同じ動作をさせるのでもプログラムの方法は様々で、プログラムの仕方で、処理速度が変わることもあります。　単純な計算で例えると、「2×1000」のかけ算を足し算の繰り返しで計算するときに、「2を1000回足す」のと「1000を2回足す」のでは計算回数が大きく違います。　また、ゲームを作るのであれば、違う意味での「センス」が必要です。ゲームの作り方は習えば誰にでもできるようになりますが、「面白いゲーム」を作るのは個人のセンスです。絵の描き方を習って上手に描けるかは別問題なのと同様ですね。"
    },
    "024": {
        "category": "プログラミング",
        "sub_category": "私生活",
        "answer": "「特にありません」　よく、コンピュータの業界は忙しく大変なイメージをされる方も居ますが、多くは誤解です。コンピュータ関連の会社はたくさんあり、仕事内容の選び方次第かと思います。また、最近は国で働く時間の規制も強くなってきていますので、休みが多かったり残業ゼロの会社もあります。　暗い部屋で座りっぱなしで仕事をしていたら、健康が心配になりますが、それは働く側が気を付ければよいことです。"
    },
    "025": {
        "category": "プログラミング",
        "sub_category": "身近",
        "answer": "意外に、難しい質問です。あえて機能単位で言えば、「ボタンを押したときに反応するプログラム」と言っておきましょうか。最近のシステム開発では、オブジェクト指向開発と言って、機能ごとに独立して開発しそれを最後にまとめるという作り方をしますので、既に作ったことがある部品があれば再利用できます。「クルマ」で簡単に説明すれば、エンジンにタイヤを2個着ければ「バイク（2輪車）」、エンジンにタイヤを4個着ければ「車（4輪車）」になるという考えです。部品さえしっかりできていれば複雑な処理のプログラムも簡単にできてしまいます。"
    },
    "026": {
        "category": "プログラミング",
        "sub_category": "重要",
        "answer": "システム開発全体で言えば「設計」が大事です。プラモデルに例えると、「説明書」を作るのと同様で、「説明書」を間違ってしまうと、組み立てる人全てが間違ってしまいます。プログラミングだけの狭い意味で言えば「正確性」です。タイピングのスピードは関係ありません。誤ったプログラミングをして動かないのであればまだしも、中途半端に動いてしまうと、誤った個所を見つけ出すのに苦労します。"
    },
    "027": {
        "category": "プログラミング",
        "sub_category": "どのような",
        "answer": "学科によって異なります。システム開発系学科であれば、世の中で動いているシステムさながらのプログラムを作りますし、ゲーム系学科ではＶＲのゲームなども作ります。"
    },
    "028": {
        "category": "プログラミング",
        "sub_category": "注意点",
        "answer": "プログラミングは「スピード」より「正確性」です。打ち間違いのバグには見つかりにくいものもあり、後に苦労します。"
    },
    "029": {
        "category": "プログラミング",
        "sub_category": "ゲーム",
        "answer": "ゲーム作りの「方法」は学べば誰にでも身につきます。しかし、ゲームクリエイタとして仕事をするためには、さらに「センス」が必要になります。絵の描き方を勉強しても必ず上手な絵が描けるとは限らないことと同じです。「センス」は習うのではなく磨くもので、磨くために例えば…　・いろいろなゲームを遊んで知る（TVゲームだけではなく、スポーツや競技などルールを知るなども）　・家族と旅行に行ったり、友達と出かけたり、世の中の物を見る・知る　・ニュースを見たり雑誌を読んだりして流行や世の中の動向にアンテナを張ることが大事かと思います。　リアルな野球を見ていない・知らない人には野球ゲームは作れませんし、雲の動き、雨降り方、季節の色…あらゆることに関心と興味を持ってみて下さい。それでさらに余力があるのでしたら、プログラミングをやってみるといいと思いますよ。"
    },
    "030": {
        "category": "仕事",
        "sub_category": "やりがい",
        "answer": "IT業界のやりがいをお答えします。「たくさんの人たちが、便利で快適な生活を送れるようになるための、手助けをしていること」です。　最近、皆さんはスマホやタブレットを使うことが多くなってきたかと思います。それらが明日突然使えなくなったらどうでしょう？　生命にかかわることではないかと思いますが、無いと「不便」を感じると思います。また現在は、あらゆるものがコンピュータシステムで動いているので、コンピュータシステムが全て止まってしまうと、銀行は取引できないし、スーパー、コンビニ、JRや飛行機は止まってしまいます。それだけ身近な生活にかかわっているということです。"
    },
    "031": {
        "category": "未来",
        "sub_category": "決め手",
        "answer": "いろいろな人たちの話を聞き、「自分がなりたい」という信念を貫くことです。　そのための勉強や努力は苦にならないと思います。　そして、高校からの進路は様々です。中にはＩＴ・ゲーム業界や専門学校進学に否定的な意見も聞こえてくるかもしれません。しかし、そう言った人達が自分の将来に責任を持ってくれるわけでもありません。正解にはやってみないと出ないこともあります。時には不正解なこともあるかもしれません。　それが人生です。「自分の夢により近づき、叶えられそうな場所」を的確に選んでみて下さい。"
    },
    "032": {
        "category": "ネットトラブル",
        "sub_category": "最近多",
        "answer": "年々巧妙になってきています。最近は、また、各アカウントサービスのIDの確認や変更連絡を装いIDを盗み取る事例が流行しています。SNSのアカウントを使わずに放置しておくのも危険です。対策としては常に流行しているネットトラブルの事例については知っておくことと、セキュリティ対策ソフトを最新の状況で使うことは最低限しておいてください。　国では独立名称資格の「情報処理安全確保支援士」という国家資格を新設し人材育成を推奨しています。"
    },
    "033": {
        "category": "プログラム",
        "sub_category": "時間",
        "answer": "作るものによります。簡単なものであれば数時間、大きいものであれば1年以上かかります。"
    },
    "034": {
        "category": "プログラム",
        "sub_category": "限界",
        "answer": "限界はありません。強いて言えば使用するコンピュータのメモリ容量と処理性能次第です。昔のコンピュータやICチップにはメモリ容量の制限の都合、作ることができるソフトウェアの容量にも限界がありましたが、近年はメモリ容量増大や拡張技術が発展し、容量は気にしなくてよくなってきました。処理性能も飛躍的に向上しましたので、事実上限界がありません。"
    },
    "035": {
        "category": "資格や知識",
        "sub_category": "必要",
        "answer": "直接ゲームプログラマに必要な資格はありません。しかし、ゲーム業界はＩＴ業界の一角であり、将来的にＩＴ系企業全般で活躍する方も居るため、情報系の国家資格「情報処理技術者試験 基本情報技術者」などは持っていると有効です。難易度が高い試験であるため、簡単には合格できません。また、ゲーム企業では資格の「内容」というよりも難易度の高いことに「チャレンジして結果を出す」ということで資格取得を評価してくれますので、決して無駄にはなりません。　知識としては、今、中学校で学べることを手を抜かず取り組んでみて下さい。　例えば、リアルなカーレースゲームを作るには、車の行動や挙動特性、路面の違いでの滑りの違いなどを知ったり、計算できないとリアルな動きを再現することはできません。そのために、「理科」で運動の法則を学び、「数学」で学んだ複雑な計算ができなくてはなりません。　また、カッコよく画面表示するために、よく「英語」を多用しますし、アドベンチャーゲームなら台詞があるので「国語」の力が必要です。さらに歴史シミュレーションゲームを作るためには「歴史」の勉強が必要です。"
    },
    "036": {
        "category": "どのような",
        "sub_category": "知",
        "answer": "基礎的なことは必ず知っておくべきです。　ちなみに、ゲーム作りの「方法」は学べば誰にでも身につきます。しかし、ゲームクリエイタとして仕事をするためには、さらに「センス」が必要になります。絵の描き方を勉強しても必ず上手な絵が描けるとは限らないことと同じです。「センス」は習うのではなく磨くもので、磨くために例えば…　・いろいろなゲームを遊んで知る（TVゲームだけではなく、スポーツや競技などルールを知るなども）　・家族と旅行に行ったり、友達と出かけたり、世の中の物を見る・知る　・ニュースを見たり雑誌を読んだりして流行や世の中の動向にアンテナを張ることが大事かと思います。　リアルな野球を見ていない・知らない人には野球ゲームは作れませんし、雲の動き、雨降り方、季節の色…あらゆることに関心と興味を持ってみて下さい。それでさらに余力があるのでしたら、プログラミングをやってみてはいかがでしょう。"
    },
    "037": {
        "category": "将来",
        "sub_category": "職業選択",
        "answer": "「ＩＴ・ゲーム」系の職種はもちろんですが、コンピュータを使う環境は一般企業全域になっております。したがって、エンジニアにこだわりが無ければ、ほとんどの業界で学んだ力を発揮できます。"
    },
    "038": {
        "category": "将来",
        "sub_category": "努力",
        "answer": "勉強はもちろんですが、部活や遊びもいろいろなことに興味・関心を持ちチャレンジしてください。家に引きこもってＰＣだけをやっていても、新しいアイディアは生まれません。"
    },
    "039": {
        "category": "AIやVR",
        "sub_category": "利点問題点",
        "answer": "AIは既に商品の売り上げ予測や経営の意思決定にも利用されています。今はビッグデータという、世界中のスマートフォンなどから集められた情報を解析して活用していますので、人間の情報収集量よりはるかに大きくその中で最適な判断をしています。このため、今後ますます人間の判断により近い決定ができるようになりますので、仕事に大きく影響していきます。反面、人間には感情や感覚といったまだ数値化が難しい部分もあり、コンピュータの判断が絶対的に正しいとも言えないこともあります。このため、依存しすぎずに、適正に使う必要があります。また犯罪利用にも使われかねませんので、その対策が必要となります。VRはあくまで、コンピュータの画面を表示するツールの1つで、360度の視界を確保できますので、ゲームやシステムで新しい表現ができるようになります。問題点は利用環境での安全性です。現実世界の視界が失われますので、ぶつかったり事故の原因にもなりかねません。利用する場所（広さ）を十分確保して楽しく利用してみましょう。"
    },
    "040": {
        "category": "ソフト",
        "sub_category": "制作",
        "answer": "数日で数万程度で作る小さいアプリもあれば、6年くらいで50億円以上かけて作るゲームもあり、また、家庭用ゲーム機（コンシューマ）用、スマートフォン用、ゲームセンター（アーケード）用と、ゲームも使用される環境で大きく異なりますので平均費用を出すのは難しいです。"
    },
    "041": {
        "category": "ソフト",
        "sub_category": "使",
        "answer": "プログラミング、ゲーム制作、画像処理、文書作成…用途によって使用するソフトは異なります。　参考までに　　プログラミング…EclipseやVisual Studio　　ゲーム制作…UnityやUnreal Engine　　画像処理…Maya、Photoshop、Illustrator　　文書作成…Word　などです。"
    },
    "042": {
        "category": "ITやプログラミング",
        "sub_category": "大変",
        "answer": "限られた時間や予算の中で、お客様が求めている要件をクリアしてあげることです。　例えば、ケーキを連想してください。オーダーメイドでフルーツたっぷりの大型のケーキを、明日まで1000円で作ってと言われても、時間も予算も無理があります。お客様が必要な大きさ、フルーツを厳選して、少しでもお客様の要望を叶えますよね。　同じように、システム開発でも時間的にも予算的にも厳しいものもあります。お客様と話し合い、お客様が納得、満足できるシステムを考えなければなりません。"
    },
    "043": {
        "category": "機械",
        "sub_category": "原理",
        "answer": "機械＝コンピュータと捉えて回答します。　コンピュータで使用する数字は「2進数」といい、「０」と「１」の2種類の数字を組み合わせて人間が使う全ての数字を表現します。「０」と「１」は電子回路の中で保存されたり計算しますが、簡単に説明すると電流の「ON」と「OFF」に置き換えるんです。電子回路で電流の流れをコントロールすることで、計算することになります。高性能なコンピュータほどこの電子回路が大きく、高速に処理ができるということになります。"
    },
    "044": {
        "category": "どのような",
        "sub_category": "携",
        "answer": "「職種」と捉えて回答します。職種は学校概要説明にて資料を配付し説明します。"
    },
    "045": {
        "category": "資格",
        "sub_category": "取",
        "answer": "経済産業省の国家資格「情報処理技術者試験」を中心に各種検定試験を取得できます。　詳しくは学校概要説明の中でお話しします。"
    },
    "046": {
        "category": "資格",
        "sub_category": "卒業",
        "answer": "在学中に、経済産業省の国家資格「情報処理技術者試験」を中心に各種検定試験を取得できます。"
    },
    "047": {
        "category": "資格",
        "sub_category": "必要",
        "answer": "直接ゲームプログラマに必要な資格はありません。しかし、ゲーム業界はＩＴ業界の一角であり、将来的にＩＴ系企業全般で活躍する方も居るため、情報系の国家資格「情報処理技術者試験 基本情報技術者」などは持っていると有効です。難易度が高い試験であるため、簡単には合格できません。また、ゲーム企業では資格の「内容」というよりも難易度の高いことに「チャレンジして結果を出す」ということで資格取得を評価してくれますので、決して無駄にはなりません。内容に関しては、学校概要説明の中でお話しします。"
    },
    "048": {
        "category": "中学校の勉強",
        "sub_category": "頑張",
        "answer": "コンピュータやプログラミングの勉強は中学校でする機会があればいいのですが、無くても背伸びしてせずに、中学校で普段やっている普通教科をしっかり学んでください。　例えばゲームを作るとしても、リアルな動きを作るためには「理科の運動法則」や「計算力」が必要です。歴史シミュレーションを作るなら「歴史」を知らなければなりませんし、シナリオを描くためには「国語力」が必要です。"
    },
    "049": {
        "category": "教科",
        "sub_category": "重要",
        "answer": "全ての科目が必要です。現在苦手な教科があるかもしれません。「得意になるまで」とは言いません。せめて周りの人たちと同じくらいは知っていてほしいです。得意な教科があればそれは大事に伸ばしてみて下さい。将来、その知識が活かされると思います。"
    }
}
