{
    "001": {
        "category": "アプリ",
        "sub_category": "有名",
        "answer": "学生期間に制作するソフトは、コンテスト出品や、ゲームショウ出展などがメインになりますので、一般には有名になりません。一般に公開しているものではiOSやAndroid向けの「BlockCrash」などがあります。"
    },
    "002": {
        "category": "全校生徒",
        "sub_category": "男女",
        "answer": "およそ男子88％、女子12%です。"
    },
    "003": {
        "category": "遠方",
        "sub_category": "来",
        "answer": "約4割で330名くらいです。"
    },
    "004": {
        "category": "入学",
        "sub_category": "毎年",
        "answer": "平均すると350名くらいです。"
    },
    "005": {
        "category": "寮",
        "sub_category": "ある",
        "answer": "本校専用ではありませんが、近隣に学生会館と下宿があり、希望者にはご案内しております。あと、本校近隣は一人暮らし向けのアパートが数多くあり、月2万円くらいの家賃で生活できるところも多く、遠方から来た生徒の約7割は一人暮らしをしております。"
    },
    "006": {
        "category": "学校",
        "sub_category": "珍",
        "answer": "コンピュータの学校なので、特段珍しい施設はありません。コンピュータは約1,000台あります。この9月にはゲーミングノートPCを導入したクリエイタルームがリニューアル完成します。"
    },
    "007": {
        "category": "学校",
        "sub_category": "大変",
        "answer": "日々大変です。IT・ゲーム業界を志す学生さんにスキルを身につけてもらい、社会に送り出すことをしています。ITの技術は日進月歩で、どんどん新しいことが入ってきます。先生方は学生さんに教えるために、自分で使える以上の勉強が必要なんです。それでも、その学生が成長して笑顔で卒業し、社会で活躍している姿を見るとその大変さが報われます。"
    },
    "008": {
        "category": "学校",
        "sub_category": "卒業",
        "answer": "8割がIT技術者です。ビジネス系の学科もあるので一般企業や公務員に就く人もいます。今は、一般企業でもコンピュータは必須アイテムですので、学んだことはIT業界のみならず、全ての　　業界において活用できます。"
    },
    "009": {
        "category": "学校",
        "sub_category": "どのような",
        "answer": "そんなに難しいことではありません。「高校でできることをしっかりやってくる」、「IT・ゲーム業界をしっかり理解してくる」ことです。勉強はもちろんですが、それまでのプログラミング経験やパソコン経験は問いません。高校からの進路は様々です。中にはＩＴ・ゲーム業界や専門学校進学に否定的な意見も聞こえてくるかもしれません。「自分の夢により近づき、叶えられそうな場所」を的確に選んでみて下さい。"
    },
    "010": {
        "category": "最近のゲーム",
        "sub_category": "卒業生",
        "answer": "大手のゲーム制作会社にも各社へ就職しています。会社内での詳細は不明ですが、プログラマー採用ですので、皆さんが遊んでいるタイトルも作っていますよ。"
    },
    "011": {
        "category": "サークル",
        "sub_category": "どのような",
        "answer": "現在、サークル活動は、「クリエーター」「デザイン」「軟式野球」「サッカー」「吹奏楽」などがあります。各種大会にも参加しております。サークルは生徒主体で作ることも可能です。"
    },
    "012": {
        "category": "入試",
        "sub_category": "問題",
        "answer": "一般入学選考試験は「面接」になりますが、面接内容は「試験」ですのでお答えできません。"
    },
    "013": {
        "category": "地域",
        "sub_category": "来",
        "answer": "学生数８３３名のうち約半数が「札幌」です。逆に残り半数は札幌以外ですが、近隣地域で通学している方も居ます。遠くは旭川やと苫小牧などです。約２００名くらいの学生はひとり暮らしや、下宿・寮生活をしています。"
    },
    "014": {
        "category": "資格",
        "sub_category": "取",
        "answer": "経済産業省の国家資格「情報処理技術者試験」を中心に各種検定試験を取得できます。詳しくは学校概要説明の中でお話しします。"
    },
    "015": {
        "category": "資格",
        "sub_category": "卒業",
        "answer": "在学中に、経済産業省の国家資格「情報処理技術者試験」を中心に各種検定試験を取得できます。"
    },
    "016": {
        "category": "進学と就職",
        "sub_category": "どちら",
        "answer": "就職がほとんどです。さらに大学や大学院に進む人はほとんどいません。ただし、進級制度や編入制度があるので、2年制から3年制の3年生や、4年制の3年生に編入する人は毎年、10名くらいいます。"
    },
    "017": {
        "category": "生徒",
        "sub_category": "どのような",
        "answer": "多くの生徒が「将来ＩＴ・ゲーム業界で働きたい」と思っています。進学している出身高校はそれぞれです。同じ志を持った生徒が多く通っているので、気が合う友達も増えますよ。"
    },
    "018": {
        "category": "就職種類",
        "sub_category": "どのような",
        "answer": "約８割がIT関連の企業に就職します。全体の約６割が東京です。入学当初はほとんどの生徒が「道内就職」を考えているようですが、資格を取り、やりたいことを見つけると東京を希望するようになります。"
    },
    "019": {
        "category": "学校",
        "sub_category": "流",
        "answer": "朝は9:15に1校時目の授業がスタートします。1日に90分の授業が、3～4校時ありますので、帰宅時間は15:00か16:45となります。帰宅後は、アルバイトやサークル活動を行っている学生もおります。また、学校は20:00まで開放してますので、学校に残り勉強やゲーム作成を行っている学生も多いです。"
    },
    "020": {
        "category": "学校",
        "sub_category": "学",
        "answer": "コンピュータやプログラミングの勉強は中学校でする機会があればいいのですが、無くても背伸びしてせずに、中学校で普段やっている普通教科をしっかり学んでください。例えばゲームを作るとしても、リアルな動きを作るためには「理科の運動法則」や「計算力」が必要です。歴史シミュレーションを作るなら「歴史」を知らなければなりませんし、シナリオを描くためには「国語力」が必要です。"
    },
    "021": {
        "category": "学校",
        "sub_category": "授業",
        "answer": "本校のカリキュラムは、特別というものではございませんが、本校の講師が自信を持って提供する講義はHCSでしか受講できません。また、北海道内の大学・専門学校で本校の学生しか合格していない国家試験もあります。"
    },
    "022": {
        "category": "学校",
        "sub_category": "自慢",
        "answer": "本校の実績は自慢できるものです。学校概要説明の中でお話しします。ただ、1番の自慢は、将来に夢を持って一生懸命に頑張っている学生たちとその夢を真剣に応援する熱意を持った講師陣です。"
    },
    "023": {
        "category": "学校",
        "sub_category": "力",
        "answer": "学生全員が高い技術を身に付けて社会で活躍できるよう、クラス担任制や独自の学習サポート制度で学生一人ひとりを手厚くサポートしています。"
    },
    "024": {
        "category": "学校",
        "sub_category": "行事",
        "answer": "大きな行事としては、運動会・学園祭があります。その他にも、ボウリング大会・映画観賞会など様々な行事があります。行事を通してクラスメイトとの絆も深まり、学科を超えて多くの学生と知り合う機会にもなっています。"
    },
    "025": {
        "category": "学校",
        "sub_category": "施設や設備",
        "answer": "学生のみんなが最先端のICT技術者・ゲーム開発者になるため、最先端・高性能な施設設備が整っています。詳しくは、パンフレットのP.45・P.46で紹介しています。"
    },
    "026": {
        "category": "講師",
        "sub_category": "何人",
        "answer": "現在、本校には44人の職員がおります。"
    },
    "027": {
        "category": "行事",
        "sub_category": "何",
        "answer": "大きな行事としては、運動会、学園祭があります。それ以外にも、ボウリング大会や映画観賞会など様々な行事があり、このような行事を通して多くの学生と知り合う機会になっております。行事関係の詳細については、配布パンフレット59、60ページを参考にしてみてください。"
    },
    "028": {
        "category": "職業",
        "sub_category": "就",
        "answer": "多くの生徒が「将来ＩＴ・ゲーム業界で働きたい」と思っています。進学している出身高校はそれぞれです。同じ志を持った生徒が多く通っているので、気が合う友達も増えますよ。"
    },
    "029": {
        "category": "ゲーム会社",
        "sub_category": "交流",
        "answer": "自分たちの作った作品をゲーム会社に添削していただく機会があります。株式会社エイティング様やディライトワークス株式会社様です。また、株式会社Cygames様や株式会社セガゲームス様など多くのゲーム会社様に講演等もしていただいております。主な就職先等は、学校概要説明の中でお話しします。"
    },
    "030": {
        "category": "CG",
        "sub_category": "作",
        "answer": "現在、本校ではCGではなくVRコンテンツの開発を行っている学生が多いため、VRの仕組みについてご説明いたします。現在一般的なVRはスマートフォンのディスプレイを応用した画面をゴーグルの中に内蔵し、左右の目の視点の差でCGやゲームを立体的に見せる技術です。外的なセンサーやゴーグルに内蔵したセンサーで本体の位置や方向を確認し、リアルタイムに位置や方向を再現することで、CGやゲームの中に入り込んだ錯覚を起こします。"
    },
    "031": {
        "category": "進学先や就職先",
        "sub_category": "卒業後",
        "answer": "8割がIT技術者です。IT技術者の中には、ゲームクリエイタも含まれています。ビジネス系の学科もあるので一般企業や公務員に就く人もいます。今は、一般企業でもコンピュータは必須アイテムですので、学んだことはIT業界のみならず、全ての業界において活用できます。"
    },
    "032": {
        "category": "入学",
        "sub_category": "毎年",
        "answer": "毎年、300～400人の学生に入学していただいております。近年は、IT関連の職業を目指す人たちも多くなっており、人気分野の一つとなっていますよ。"
    },
    "033": {
        "category": "入学試験",
        "sub_category": "学力試験",
        "answer": "本校の入試では、学力試験は行っていません。面接試験のみとなっております。"
    },
    "034": {
        "category": "AO",
        "sub_category": "質問",
        "answer": "本校への入学意欲、目的意識を確認する内容の質問をさせていただきます。"
    },
    "035": {
        "category": "併願受験制度",
        "sub_category": "何",
        "answer": "本校以外に検討している進路の結果がでるまで、入学手続きを延期することができる制度です。進学併願（大学・短大）、公務員併願、就職併願制度がございます。"
    },
    "036": {
        "category": "HCS",
        "sub_category": "奨学生制度",
        "answer": "HCS奨学生、同窓子弟奨学生、既卒者入学支援特典、国家試験合格者特典、公務員受験者特典、北海道留学特典等があります。各制度の詳細については、本校ホームページまたは入学志願要項をご確認ください。"
    },
    "037": {
        "category": "学費",
        "sub_category": "いくら",
        "answer": "大学併修科とそれ以外の学科で学費が異なります。大学併修科は、専門学校納入分が88万4000円、大学納入分が41万7000円となっています。それ以外の学科は、116万6000円です。（金額には入学金を含んでいます）学費の詳細については、本校ホームページまたは入学志願要項をご確認ください。"
    },
    "038": {
        "category": "奨学生制度",
        "sub_category": "教",
        "answer": "本校で開催している進学資金説明会にご参加いただけますと詳しくご説明させていただきます。オンラインでも実施しております。資料をご希望の場合は、本校ホームページ等より資料請求をお願いいたします。"
    },
    "039": {
        "category": "2年制と3年制",
        "sub_category": "違",
        "answer": "就職活動を開始するまでの期間が大きく異なります。その分、学習できる内容が変わりますので、3年制コースで学ぶことで、より深い知識や高度技術を身につけることが可能となります。本校には、編入学・進級制度がありますので、学科で悩んでいる場合は2年制コースからスタートして将来を検討することができます。詳細については、オープンキャンパス等にご参加いただき相談してください。"
    },
    "040": {
        "category": "ゲーム企業",
        "sub_category": "就職",
        "answer": "できます！入学後に学習を進めながら、自分の「なりたい」職業を目指すことができるカリキュラムとなっています。"
    },
    "041": {
        "category": "姉妹校",
        "sub_category": "多",
        "answer": "北海道で最初にできた情報処理技術者の養成校「北海道情報専門学校」が昭和43年に開校してから、たくさんの技術者を養成してきました。卒業生の技術力の高さから、日本各地で養成校が求められるようになり、姉妹校が増えました。姉妹校が多くあることで、優れた教育ノウハウを情報交換することができ、各校でより優れた教育を学生に提供することができています。"
    },
    "042": {
        "category": "成績",
        "sub_category": "つけ",
        "answer": "技術・知識がしっかり身についているか、試験をして成績をつけます。科目によって、筆記試験か実技試験をします。"
    },
    "043": {
        "category": "技術試験",
        "sub_category": "試験",
        "answer": "実際にプログラミングをしたり、マシン環境の設定をしたり、技術がしっかり身についているか試験します。"
    }
}
